---
kind: other
id: AllMembers.T:Autodesk.Revit.DB.Electrical.ElectricalSetting
source: html/d4c32beb-804b-592f-ce43-e752573d18fd.htm
---
# ElectricalSetting Members

Add a new distribution system type to project.